# Exercise 02 -  OLAP Cubes - Solution

All the databases table in this demo are based on public database samples and transformations
- `Sakila` is a sample database created my `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

In [1]:
!PGPASSWORD= createdb -h 127.0.0.1 -U huyenvtk1 pagila_star
!PGPASSWORD= psql -q -h 127.0.0.1 -U huyenvtk1 -d pagila_star -f Data/pagila-star.sql

 set_config
------------

(1 row)

 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
  64196
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

In [2]:
%load_ext sql
import sql

# STEP1 : Connect to the local database where Pagila is loaded

In [3]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'huyenvtk1'
DB_PASSWORD = ''
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://huyenvtk1:@127.0.0.1:5432/pagila

In [4]:
%sql $conn_string

'Connected: huyenvtk1@pagila'

# STEP2 :  Star Schema

<img src="pagila-star.png" width="50%"/>

# Start by a simple cube

In [5]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate      on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer  on (dimCustomer.customer_key = factSales.customer_key)
group by (dimDate.day, dimMovie.rating, dimCustomer.city)
order by revenue desc
limit  20;

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 2.54 ms, sys: 1.12 ms, total: 3.65 ms
Wall time: 74.1 ms

[(30, 'G', 'San Bernardino', Decimal('99.88')),
 (30, 'NC-17', 'Apeldoorn', Decimal('95.80')),
 (21, 'NC-17', 'Belm', Decimal('91.88')),
 (28, 'R', 'Mwanza', Decimal('87.88')),
 (30, 'PG-13', 'Zanzibar', Decimal('87.88')),
 (21, 'G', 'Citt del Vaticano', Decimal('87.88')),
 (22, 'R', 'Yangor', Decimal('79.88')),
 (28, 'PG-13', 'Dhaka', Decimal('79.88')),
 (1, 'R', 'Qomsheh', Decimal('79.88')),
 (17, 'G', 'Rajkot', Decimal('79.88')),
 (19, 'PG', 'Najafabad', Decimal('79.84')),
 (30, 'R', 'Fengshan', Decimal('79.80')),
 (28, 'PG', 'So Leopoldo', Decimal('75.92')),
 (21, 'G', 'Wroclaw', Decimal('75.92')),
 (1, 'NC-17', 'Memphis', Decimal('75.88')),
 (19, 'PG', 'Sokoto', Decimal('75.88')),
 (30, 'G', 'Omdurman', Decimal('75.88')),
 (29, 'PG-13', 'Shimoga', Decimal('75.88')),
 (30, 'PG-13', 'Osmaniye', Decimal('75.88')),
 (21, 'PG-13', 'Asuncin', Decimal('75.80'))]

## Slicing

- Slicing is the reduction of the dimensionality of a cube by 1 e.g. 3 dimensions to 2,  fixing one of the dimensions to a single value
- In the following example we have a 3-deminensional cube on day, rating, and country
- In the example below `rating` is fixed and to "PG-13" which reduces the dimensionality

In [6]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
WHERE dimMovie.rating = 'PG-13'
GROUP by (dimDate.day, dimCustomer.city, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 1.9 ms, sys: 895 Âµs, total: 2.79 ms
Wall time: 61.8 ms

[(30, 'PG-13', 'Zanzibar', Decimal('87.88')),
 (28, 'PG-13', 'Dhaka', Decimal('79.88')),
 (29, 'PG-13', 'Shimoga', Decimal('75.88')),
 (30, 'PG-13', 'Osmaniye', Decimal('75.88')),
 (21, 'PG-13', 'Asuncin', Decimal('75.80')),
 (20, 'PG-13', 'Baha Blanca', Decimal('71.92')),
 (21, 'PG-13', 'Parbhani', Decimal('71.92')),
 (30, 'PG-13', 'Nagareyama', Decimal('71.92')),
 (30, 'PG-13', 'Tanauan', Decimal('71.84')),
 (17, 'PG-13', 'Ikerre', Decimal('71.80')),
 (30, 'PG-13', 'Zhoushan', Decimal('67.92')),
 (30, 'PG-13', 'Yerevan', Decimal('67.88')),
 (30, 'PG-13', 'Newcastle', Decimal('67.88')),
 (17, 'PG-13', 'Yantai', Decimal('63.92')),
 (30, 'PG-13', 'Santa Rosa', Decimal('63.92')),
 (20, 'PG-13', 'Santa Rosa', Decimal('63.92')),
 (8, 'PG-13', 'Pontianak', Decimal('63.92')),
 (10, 'PG-13', 'Udaipur', Decimal('63.88')),
 (1, 'PG-13', 'Moscow', Decimal('63.88')),
 (20, 'PG-13', 'Johannesburg', Decimal('63.88'))]

## Dicing
 - Creating a subcube, same dimensionality, less values for 2 or more dimensions
 - e.g. PG-13

In [7]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
WHERE dimMovie.rating in ('PG-13', 'PG')
AND dimCustomer.city in ('Bellevue', 'Lancaster')
AND dimDate.day in ('1', '15', '30')
GROUP by (dimDate.day, dimCustomer.city, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
6 rows affected.
CPU times: user 2.84 ms, sys: 1.14 ms, total: 3.98 ms
Wall time: 12 ms

[(30, 'PG', 'Lancaster', Decimal('51.92')),
 (1, 'PG-13', 'Lancaster', Decimal('23.96')),
 (30, 'PG-13', 'Bellevue', Decimal('15.96')),
 (30, 'PG-13', 'Lancaster', Decimal('11.96')),
 (15, 'PG-13', 'Bellevue', Decimal('7.92')),
 (1, 'PG', 'Bellevue', Decimal('3.96'))]

## Roll-up
- Stepping up the level of aggregation to a large grouping
- e.g.`city` is summed as `country`

In [8]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.country, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
GROUP by (dimDate.day,  dimMovie.rating, dimCustomer.country)
ORDER by revenue desc
LIMIT  20;

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 2.66 ms, sys: 1.41 ms, total: 4.07 ms
Wall time: 76.5 ms

[(30, 'G', 'China', Decimal('678.68')),
 (30, 'PG', 'India', Decimal('626.68')),
 (30, 'NC-17', 'India', Decimal('614.56')),
 (30, 'PG-13', 'China', Decimal('586.68')),
 (30, 'R', 'China', Decimal('582.64')),
 (30, 'R', 'India', Decimal('574.72')),
 (30, 'G', 'India', Decimal('550.68')),
 (18, 'NC-17', 'India', Decimal('543.00')),
 (30, 'PG', 'China', Decimal('526.88')),
 (21, 'PG-13', 'India', Decimal('514.96')),
 (18, 'PG-13', 'India', Decimal('486.88')),
 (18, 'PG', 'India', Decimal('479.04')),
 (30, 'PG-13', 'India', Decimal('466.88')),
 (21, 'NC-17', 'China', Decimal('463.08')),
 (21, 'R', 'India', Decimal('463.00')),
 (27, 'NC-17', 'India', Decimal('462.88')),
 (17, 'PG-13', 'China', Decimal('447.00')),
 (17, 'NC-17', 'United States', Decimal('439.04')),
 (30, 'NC-17', 'China', Decimal('435.08')),
 (20, 'PG-13', 'India', Decimal('407.16'))]

## Drill-down
- Breaking up one of the dimensions to a lower level.
- e.g.`city` is broken up to  `districts`

In [9]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.district, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
GROUP by (dimDate.day, dimCustomer.district, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 2.32 ms, sys: 1.26 ms, total: 3.58 ms
Wall time: 66.8 ms

[(30, 'PG-13', 'Southern Tagalog', Decimal('215.52')),
 (30, 'G', 'Inner Mongolia', Decimal('155.72')),
 (30, 'G', 'Shandong', Decimal('147.72')),
 (30, 'NC-17', 'West Bengali', Decimal('147.68')),
 (17, 'PG-13', 'Shandong', Decimal('139.80')),
 (1, 'PG', 'California', Decimal('131.76')),
 (18, 'NC-17', 'So Paulo', Decimal('131.72')),
 (21, 'R', 'So Paulo', Decimal('127.72')),
 (30, 'NC-17', 'Buenos Aires', Decimal('127.72')),
 (30, 'PG', 'Southern Tagalog', Decimal('123.76')),
 (30, 'PG', 'So Paulo', Decimal('123.72')),
 (30, 'R', 'Buenos Aires', Decimal('123.68')),
 (18, 'NC-17', 'Maharashtra', Decimal('119.80')),
 (30, 'G', 'California', Decimal('119.80')),
 (21, 'PG-13', 'Uttar Pradesh', Decimal('119.76')),
 (10, 'R', 'Maharashtra', Decimal('119.72')),
 (20, 'PG', 'Shandong', Decimal('119.72')),
 (18, 'R', 'Sumy', Decimal('115.88')),
 (21, 'PG-13', 'Southern Tagalog', Decimal('115.84')),
 (29, 'NC-17', 'So Paulo', Decimal('115.80'))]

# Grouping Sets
- It happens a lot that for a 3 dimensions, you want to aggregate a fact:
    - by nothing (total)
    - then by the 1st dimension
    - then by the 2nd 
    - then by the 3rd 
    - then by the 1st and 2nd
    - then by the 2nd and 3rd
    - then by the 1st and 3rd
    - then by the 1st and 2nd and 3rd
    
- Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a move clever way to do that using the SQL grouping statement "GROUPING SETS"

## total revenue

In [10]:
%%sql
SELECT sum(sales_amount) as revenue
FROM factSales

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
1 rows affected.

[(Decimal('269666.04'),)]

## revenue by country

In [11]:
%%sql
SELECT dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
order by dimStore.country, revenue desc;

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
2 rows affected.

[('Australia', Decimal('134907.08')), ('Canada', Decimal('134758.96'))]

## revenue by month

In [12]:
%%sql
SELECT dimDate.month,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
GROUP by dimDate.month
order by dimDate.month, revenue desc;

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, Decimal('19297.72')),
 (2, Decimal('38527.52')),
 (3, Decimal('95546.24')),
 (4, Decimal('114237.84')),
 (5, Decimal('2056.72'))]

## revenue by month & country

In [13]:
%%sql
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)
order by dimDate.month, dimStore.country, revenue desc;

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
10 rows affected.

[(1, 'Australia', Decimal('9456.76')),
 (1, 'Canada', Decimal('9840.96')),
 (2, 'Australia', Decimal('19580.40')),
 (2, 'Canada', Decimal('18947.12')),
 (3, 'Australia', Decimal('48241.32')),
 (3, 'Canada', Decimal('47304.92')),
 (4, 'Australia', Decimal('56544.28')),
 (4, 'Canada', Decimal('57693.56')),
 (5, 'Australia', Decimal('1084.32')),
 (5, 'Canada', Decimal('972.40'))]

## revenue total, by month, by country, by month & country All in one shot
- watch the nones

In [14]:
%%time
%%sql
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate  on (dimDate.date_key  = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by grouping sets ((), dimDate.month,  dimStore.country, (dimDate.month,  dimStore.country));

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 2.15 ms, sys: 1.21 ms, total: 3.36 ms
Wall time: 64.1 ms

[(1, 'Australia', Decimal('9456.76')),
 (1, 'Canada', Decimal('9840.96')),
 (1, None, Decimal('19297.72')),
 (2, 'Australia', Decimal('19580.40')),
 (2, 'Canada', Decimal('18947.12')),
 (2, None, Decimal('38527.52')),
 (3, 'Australia', Decimal('48241.32')),
 (3, 'Canada', Decimal('47304.92')),
 (3, None, Decimal('95546.24')),
 (4, 'Australia', Decimal('56544.28')),
 (4, 'Canada', Decimal('57693.56')),
 (4, None, Decimal('114237.84')),
 (5, 'Australia', Decimal('1084.32')),
 (5, 'Canada', Decimal('972.40')),
 (5, None, Decimal('2056.72')),
 (None, None, Decimal('269666.04')),
 (None, 'Canada', Decimal('134758.96')),
 (None, 'Australia', Decimal('134907.08'))]

# CUBE 
- Group by CUBE (dim1, dim2, ..) , produces all combinations of different lenghts in one go.
- This view could be materialized in a view and queried which would save lots repetitive aggregations

```SQL
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate  on (dimDate.date_key   = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by cube(dimDate.month,  dimStore.country);
```

In [15]:
%%time
%%sql
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by cube(dimDate.month,  dimStore.country);

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 1.99 ms, sys: 1.24 ms, total: 3.22 ms
Wall time: 64.6 ms

[(1, 'Australia', Decimal('9456.76')),
 (1, 'Canada', Decimal('9840.96')),
 (1, None, Decimal('19297.72')),
 (2, 'Australia', Decimal('19580.40')),
 (2, 'Canada', Decimal('18947.12')),
 (2, None, Decimal('38527.52')),
 (3, 'Australia', Decimal('48241.32')),
 (3, 'Canada', Decimal('47304.92')),
 (3, None, Decimal('95546.24')),
 (4, 'Australia', Decimal('56544.28')),
 (4, 'Canada', Decimal('57693.56')),
 (4, None, Decimal('114237.84')),
 (5, 'Australia', Decimal('1084.32')),
 (5, 'Canada', Decimal('972.40')),
 (5, None, Decimal('2056.72')),
 (None, None, Decimal('269666.04')),
 (None, 'Canada', Decimal('134758.96')),
 (None, 'Australia', Decimal('134907.08'))]

In [17]:
%%time
%%sql
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month,  dimStore.country);

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
10 rows affected.
CPU times: user 1.97 ms, sys: 3.53 ms, total: 5.5 ms
Wall time: 55.8 ms

[(1, 'Australia', Decimal('9456.76')),
 (1, 'Canada', Decimal('9840.96')),
 (2, 'Australia', Decimal('19580.40')),
 (2, 'Canada', Decimal('18947.12')),
 (3, 'Australia', Decimal('48241.32')),
 (3, 'Canada', Decimal('47304.92')),
 (4, 'Australia', Decimal('56544.28')),
 (4, 'Canada', Decimal('57693.56')),
 (5, 'Australia', Decimal('1084.32')),
 (5, 'Canada', Decimal('972.40'))]

## revenue total, by month, by country, by month & country All in one shot, NAIVE way

In [16]:
%%time
%%sql
SELECT  NULL as month, NULL as country, sum(sales_amount) as revenue
FROM factSales
    UNION all 
SELECT NULL, dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
    UNION all 
SELECT cast(dimDate.month as text) , NULL, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
GROUP by dimDate.month
    UNION all
SELECT cast(dimDate.month as text),dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)

 * postgresql://huyenvtk1:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 3.05 ms, sys: 1.08 ms, total: 4.13 ms
Wall time: 61.6 ms

[(None, None, Decimal('269666.04')),
 (None, 'Canada', Decimal('134758.96')),
 (None, 'Australia', Decimal('134907.08')),
 ('3', None, Decimal('95546.24')),
 ('5', None, Decimal('2056.72')),
 ('4', None, Decimal('114237.84')),
 ('2', None, Decimal('38527.52')),
 ('1', None, Decimal('19297.72')),
 ('1', 'Australia', Decimal('9456.76')),
 ('1', 'Canada', Decimal('9840.96')),
 ('2', 'Australia', Decimal('19580.40')),
 ('2', 'Canada', Decimal('18947.12')),
 ('3', 'Australia', Decimal('48241.32')),
 ('3', 'Canada', Decimal('47304.92')),
 ('4', 'Australia', Decimal('56544.28')),
 ('4', 'Canada', Decimal('57693.56')),
 ('5', 'Australia', Decimal('1084.32')),
 ('5', 'Canada', Decimal('972.40'))]